package com.Store.www.entity;

import java.util.List;

/**
 * 常见问题响应体
 */

public class CommonIssueResponse {

    /**
     * result : 200
     * data : [{"detail":"                                   <p>官方微信公众号：kivie-China&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\r\n全国热线：0574-87993888 <\/p><p>官网网站：www.KIVIE.com&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\r\n加盟邮箱：jiameng@jwbra.com<\/p><p>授权证书邮箱：zhengshu@jwbra.com<\/p>\r\n                                 <p><br><\/p>","desc":"司官方的信息可以哪里查？"},{"detail":"                                   <p>金薇加盟政策：首先必须购买2件金薇文胸或2条KK裤，我们需要每位代理商充分认可产品，才可申请加盟，只有完全了解金薇的产品才能知道是否值得自己去推广是最您的负责。认可后将提供公司联系方式并缴纳300元加盟费于公司账户，制度与代理商拿货价格均一样，有量有价,公司客服系统录入之后会给你一个代理编号，说明你是有资格在微信销售了。同时享受批发价，可代发，可囤货，任您选择。<\/p>\r\n                                 <p><br><\/p>","desc":"金薇怎么代理加盟？"},{"detail":"                                   <p><\/p><p>亲爱的，公司目前开发的产品有高端、呼吸、烧花、樱花恋、玲珑、KK能量裤、KK先生裤。<\/p><p><br><\/p>","desc":"公司有哪些产品？"},{"detail":"                                   <p>首先我们的产品均获得专利证书，属于独家研发产品。<\/p><p>一、呼吸款：采用进口呼吸绵也叫透水绵，顾名思义就是水可以穿透海绵来证明它的强大透气性。此棉采用最优质的进口原材料，结合外商发明技术，经过多年的研究发明、反复测试而成的一款健康又环保的新型材料。（2）杯内采用优质蜂巢布：吸湿、排汗、有氧抑菌新型布料。有氧透气+塑身调整，改善胸部下垂外扩等<\/p><p>二、高端款：采用亲肤棉也称为皮肤棉，此款柔软舒适，如同第二肌肤，婴儿肌肤般柔软，注重自然高端选材，目前国内市场是无法达到我们的舒适度的，同时也让有小叶增生的女性得到细心的呵护，达到非裸似裸的穿着体验，更成为女性经期首选文胸，真正实现了无痕杯\u201cO\u201d压力，\u201cO\u201d距离。 &nbsp;\r\n\r\n<\/p><p>三、樱花恋：采用进口呼吸绵也叫透水绵，唯美设计，采用精致网纱包覆杯面，朴质的花朵刺绣，立体质感，高端大气，视觉丰富。杯边的不规则包边绣，恬静女人味道，性感婉约，尽显女性高贵气质，优雅与美好寓意集一体，让你沉浸在性感浪漫的气氛之中。蝶形下扒位配上唯美的花朵，带来无限性感妩媚，时尚聚拢，散发出女性独特的魅力，集中视觉焦点，将性感与时尚气息完美结合，尽显女性柔美温婉气质。\r\n<\/p><p>四、玲珑款：采用最新研发的自由绵，杯面采用蕾丝深v设计，塑造迷人乳沟，心位花边交叉设计，突显胸部集中效果，下扒原光双拉拼接搭配撞色织带，增强视觉层次感，经典中演绎低调的奢华，绽放优雅魅力。<\/p><p>五、KK能量裤：通过生物能传导技术，结合传统中医人体经络医学原理，借助微观世界\u201c量子生物能量波\u201d，将量子生物能量波快速渗透皮肤细胞下，组织与人体细胞分子的振动频率实现同频共振，透过共鸣，借助分子间摩擦生热，加速细胞反应，促进皮下深层温度微升，加速血液循环，扩张微血管，并且将人体原有吸收的有害电磁辐射能转换成对人体有益的量子能量波。瞬间打开穴位，为人体补充宇宙正能量。<\/p><p>激活人体七大腺及有益酶类，缓解疲劳，增强体力，缓解疼痛，帮助睡眠，尤其是对男性前列腺具有十分明显的效果。<\/p><p>六、KK先生裤：原料产自于欧洲的榉木，先将其制成木浆，再纺丝加工成纤维，是100%的天然纤维，并能够自然分解，对人体无害，是纯正的天然纤维。榉木纹理清晰，木材质地均匀，色调柔和流畅，是木中的绅士。由此产生的MICRO MODAL纤维，其特点比蚕丝还要细，手感爽滑、细腻、悬垂性好，具有天然真丝的效果；纤维均匀，具有良好的可纺性和纺织性；\r\n且湿模量较高，其纱线的缩水率仅为1%左右，是理想的贴身织物和保健服饰产品，有利于人体的生理循环和健康。<\/p><p>七、简·居衣：女士睡衣家居服，采用兰精莫代尔面料，柔软顺滑、舒服亲肤，零束缚且弹性比较好，真正达到似裸非裸的感觉。同时V字型领口拼接性感的白色蕾丝，优雅而不失性感。适用于春夏秋三个季节，居家睡衣，修身百搭，也可打底外穿。<\/p><p><br><\/p>","desc":"公司产品有什么优势？"},{"detail":"                                   <p><\/p><p>金薇现销售的有微商、微店、实体店这三个平台哦<\/p><p><br><\/p>","desc":"金薇产品可以在哪几个平台销售？"},{"detail":"                                   <p>亲爱的，尺码内衣的罩杯大小，是由机器标准化生产，但每件内衣的下胸围是人工车缝的，工作在制作时每位工作人员拿捏的松紧度会有不同，所以会出现相同尺码但是长度不同，正常内衣都是有1-3CM的误差哦，穿着效果会略有不同，此时只需扣第二排扣即可，但是效果是一样的哦！<\/p><p><br><\/p>","desc":"内衣同款同尺码会出现穿着效果不一样？"},{"detail":"                                   <p>公司产品的图片、质检报告这些在哪里获取？<\/p><p><\/p><p>链接：http://pan.baidu.com/s/1c12JSic\r\n密码：zt61<\/p><p><br><\/p>","desc":"公司产品的图片、质检报告这些在哪里获取？"},{"detail":"                                   <p>肩带可以配吗？<\/p><p>亲爱的，可以购买的。江浙沪6块钱，其他地区运费12块，肩带2元一副，支付宝：caiwu@jwbra.com\r\n，您把打款截图发我，然后留个姓名，电话，地址，款式给我，这边给您安排寄出。<\/p><p><br><\/p>","desc":"肩带可以配吗？"},{"detail":"                                   <p><\/p><p>亲爱的，我们的内衣面料比较柔软，快递运输的过程中不可避免会产生轻微压痕哦，您可以用挂烫机轻轻抚平的呢，这个是不影响穿着效果的哦。<\/p><p><br><\/p>","desc":"收到的内衣有轻微压痕？"}]
     */

    private int result;
    private List<DataBean> data;

    public int getResult() {
        return result;
    }

    public void setResult(int result) {
        this.result = result;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * detail :                                    <p>官方微信公众号：kivie-China&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
         全国热线：0574-87993888 </p><p>官网网站：www.KIVIE.com&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
         加盟邮箱：jiameng@jwbra.com</p><p>授权证书邮箱：zhengshu@jwbra.com</p>
         <p><br></p>
         * desc : 司官方的信息可以哪里查？
         */

        private String detail;
        private String desc;

        public String getDetail() {
            return detail;
        }

        public void setDetail(String detail) {
            this.detail = detail;
        }

        public String getDesc() {
            return desc;
        }

        public void setDesc(String desc) {
            this.desc = desc;
        }
    }
}
